UTAF_Base/requestFiles/BPS_Customer_CreateExt.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:urn="urn:v4.context.vss.objects.bgc" xmlns:urn1="urn:v5.customer.bps.services.bgc"
	xmlns:urn2="urn:v1.bpsmodel.bps.objects.bgc">
	<soapenv:Header>
      <urn:Context version="4.0">
          <urn:correlationId>${Req_corrId}</urn:correlationId>
         <urn:consumerApplicationId>TST</urn:consumerApplicationId>
         <!--Optional:-->
         <urn:endUserId>id000000</urn:endUserId>
         <!--Optional:-->
         <urn:endUserLanguage>EN</urn:endUserLanguage>
         <!--Optional:-->
         <urn:propagatedKey>?</urn:propagatedKey>
      </urn:Context>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:RequestDataCreateExt version="5.1">
         <urn1:userContext>
            <urn2:applicationNm>TST</urn2:applicationNm>
            <urn2:correlationId>${Req_corrId}</urn2:correlationId>
            <urn2:userId>id000000</urn2:userId>
            <urn2:languageIso2Code>EN</urn2:languageIso2Code>
         </urn1:userContext>	
			<urn1:marketingSubsegment>${Req_marketingSubsegnment}</urn1:marketingSubsegment>			
			<urn1:businessType>${Req_businessType}</urn1:businessType>			
			<urn1:activityNaceCode>${Req_activityNaceCode}</urn1:activityNaceCode>
			<urn1:streetCode>${Req_streetCode}</urn1:streetCode>			
			<urn1:residenceName>${Req_residentName}</urn1:residenceName>			
			<urn1:industrialZone>${Req_industrialZone}</urn1:industrialZone>
			<urn1:houseNbr>${Req_houseNbr}</urn1:houseNbr>			
			<urn1:alphaHouseNbr>${Req_alphaHouseNbr}</urn1:alphaHouseNbr>			
			<urn1:boxNbr>${Req_boxNbr}</urn1:boxNbr>			
			<urn1:apartmentNbr>${Req_apartmentNbr}</urn1:apartmentNbr>			
			<urn1:blockNbr>${Req_blockNbr}</urn1:blockNbr>			
			<urn1:floorNbr>${Req_floorNbr}</urn1:floorNbr>
			<urn1:cityCode>${Req_cityCode}</urn1:cityCode>
			<urn1:countryIso3Code>${Req_countryIso3Code}</urn1:countryIso3Code>			
			<urn1:legalFormCode>${Req_legalFormCode}</urn1:legalFormCode>			
			<urn1:titleCode>${Req_titleCode}</urn1:titleCode>			
			<urn1:subTitleDescr>${Req_subTitleDescr}</urn1:subTitleDescr>			
			<urn1:name>${Req_name}</urn1:name>			
			<urn1:firstName>${Req_firstName}</urn1:firstName>			
			<urn1:printName>${Req_printName}</urn1:printName>			
			<urn1:nationalityIso3Code>${Req_nationalityIso3Code}</urn1:nationalityIso3Code>			
			<urn1:birthDate>${Req_birthDate}</urn1:birthDate>			
			<urn1:foundationDate>${Req_foundationDate}</urn1:foundationDate>			
			<urn1:nationalNbr>${Req_nationalNbr}</urn1:nationalNbr>			
			<urn1:nationalNbrCountryIso2Code>${Req_nationalNbrCountryIso2Code}</urn1:nationalNbrCountryIso2Code>			
			<urn1:vatNbrOnBillInd>${Req_vatNbrOnBillInd}</urn1:vatNbrOnBillInd>			
			<urn1:subjectToVatInd>${Req_subjectToVatInd}</urn1:subjectToVatInd>			
			<urn1:notes>${Req_notes}</urn1:notes>
			<urn1:legalLangIso2Code>${Req_legalLangIso2Code}</urn1:legalLangIso2Code>
			<urn1:communicationLangIso2Code>${Req_communicationLangIso2Code}</urn1:communicationLangIso2Code>			
			<urn1:commLangAllAccInd>${Req_commLangAllAccInd}</urn1:commLangAllAccInd>
			<urn1:antiMarketingInd>${Req_antiMarketingInd}</urn1:antiMarketingInd>
			<urn1:restrictelInd>${Req_restrictelInd}</urn1:restrictelInd>			
			<urn1:legalStatusCode>${Req_legalStatusCode}</urn1:legalStatusCode>			
			<urn1:sectorCode>${Req_sectorCode}</urn1:sectorCode>		
			<urn1:customerExternalRef>				
				<urn1:macroSegmentCode>${Req_macroSegmentCode}</urn1:macroSegmentCode>				
				<urn1:mcsCustId>${Req_mcsCustId}</urn1:mcsCustId>				
				<urn1:euroDbId>${Req_euroDbId}</urn1:euroDbId>				
				<urn1:hqEuroDbId>${Req_hqEuroDbId}</urn1:hqEuroDbId>				
				<urn1:wegenerId>${Req_wegenerId}</urn1:wegenerId>
				<urn1:externalCheckInd>${Req_externalCheckInd}</urn1:externalCheckInd>
			</urn1:customerExternalRef>
		</urn1:RequestDataCreateExt>
	</soapenv:Body>
</soapenv:Envelope>
